Ran Plan for project: `marketplace-sqs-stage` dir: `terraform/environments/stage/sqs` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.sqs_access will be updated in-place
~ resource "aws_iam_policy" "sqs_access" {
        id               = "arn:aws:iam::646886795421:policy/marketplace-sqs-access-stage"
        name             = "marketplace-sqs-access-stage"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "sqs:SendMessage",
                          - "sqs:ReceiveMessage",
                          - "sqs:DeleteMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:GetQueueUrl",
                          - "sqs:ChangeMessageVisibility",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-scoring",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-scoring-dlq",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-enhancement",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-enhancement-dlq",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-verification",
                          - "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-inspection-verification-dlq",
                        ]
                      - Sid      = "SQSAccess"
                    },
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:GenerateDataKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294",
                        ]
                      - Sid      = "KMSDecrypt"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "cost_center"  = "engineering"
            "data_class"   = "internal"
            "environment"  = "stage"
            "owner"        = "platform@ryuqqq.com"
            "project"      = "marketplace"
            "service_name" = "marketplace-sqs"
            "team"         = "platform-team"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_sqs_queue.intelligence_description_analysis will be created
+ resource "aws_sqs_queue" "intelligence_description_analysis" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "stage-marketplace-intelligence-description-analysis"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-intelligence-description-analysis-dlq"
              + maxReceiveCount     = 3
            }
        )
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-description-analysis"
          + "Purpose"      = "Description text AI analysis - Sonnet"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-description-analysis"
          + "Project"      = "marketplace"
          + "Purpose"      = "Description text AI analysis - Sonnet"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 600
    }

  # aws_sqs_queue.intelligence_notice_analysis will be created
+ resource "aws_sqs_queue" "intelligence_notice_analysis" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "stage-marketplace-intelligence-notice-analysis"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-intelligence-notice-analysis-dlq"
              + maxReceiveCount     = 3
            }
        )
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-notice-analysis"
          + "Purpose"      = "Notice completion analysis - Haiku"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-notice-analysis"
          + "Project"      = "marketplace"
          + "Purpose"      = "Notice completion analysis - Haiku"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_sqs_queue.intelligence_option_analysis will be created
+ resource "aws_sqs_queue" "intelligence_option_analysis" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "arn:aws:kms:ap-northeast-2:646886795421:key/2ab044c4-8a47-4655-98ed-404ec3efb294"
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "stage-marketplace-intelligence-option-analysis"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = jsonencode(
            {
              + deadLetterTargetArn = "arn:aws:sqs:ap-northeast-2:646886795421:stage-marketplace-intelligence-option-analysis-dlq"
              + maxReceiveCount     = 3
            }
        )
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Name"         = "stage-marketplace-intelligence-option-analysis"
          + "Purpose"      = "Canonical option mapping analysis - Haiku"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all                          = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Name"         = "stage-marketplace-intelligence-option-analysis"
          + "Project"      = "marketplace"
          + "Purpose"      = "Canonical option mapping analysis - Haiku"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # aws_ssm_parameter.intelligence_description_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_description_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/intelligence-description-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_notice_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_notice_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/intelligence-notice-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.intelligence_option_analysis_queue_url will be created
+ resource "aws_ssm_parameter" "intelligence_option_analysis_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/marketplace/sqs/intelligence-option-analysis-queue-url"
      + tags           = {
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tags_all       = {
          + "Environment"  = "stage"
          + "ManagedBy"    = "terraform"
          + "Project"      = "marketplace"
          + "cost_center"  = "engineering"
          + "data_class"   = "internal"
          + "environment"  = "stage"
          + "owner"        = "platform@ryuqqq.com"
          + "project"      = "marketplace"
          + "service_name" = "marketplace-sqs"
          + "team"         = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+ intelligence_description_analysis_queue_url = (known after apply)
+ intelligence_notice_analysis_queue_url      = (known after apply)
+ intelligence_option_analysis_queue_url      = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p marketplace-sqs-stage
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FMarketPlace%252Fterraform%252Fenvironments%252Fstage%252Fsqs%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p marketplace-sqs-stage
  ```
Plan: 6 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```